{
  "UBLL4S-30-1": {
    "id": "UBLL4S-30-1",
    "year of study": "1",
    "moduleName": "Studio 1.1 - Form and Context",
    "moduleTheme": "Studio",
    "keyInfo": [
      { "label": "Credits", "value": "30" },
      { "label": "Semester", "value": "1" },
      { "label": "Assessment", "value": "Portfolio (Pass/Fail): A curated portfolio showing iterative analogue design processes (hand‑drawing, physical models), contextual analysis and critical reflection." }
    ],
    "synopsis": "You'll explore foundational architectural design through analogue techniques like hand-drawing and physical model-making. Emphasising iterative processes, spatial awareness, materiality, and contextual responsiveness for design development.",
    "outcomes": [
      "MO1 Demonstrate foundational skills in spatial design—including form, proportion and materiality—through iterative experimentation, feedback and reflection.",
      "MO2 Articulate relationships between architectural form, contextual influences and conceptual frameworks, drawing on precedents to inform decisions.",
      "MO3 Communicate design ideas effectively through drawing and modelling, using architectural conventions."
    ],
    "arb": []
  },
  "UBLL4Y-30-1": {
    "id": "UBLL4Y-30-1",
    "year of study": "1",
    "moduleName": "Studio 1.2 - People and Environment",
    "moduleTheme": "Studio",
    "keyInfo": [
      { "label": "Credits", "value": "30" },
      { "label": "Semester", "value": "2" },
      { "label": "Assessment", "value": "Portfolio (Pass/Fail): A design portfolio for a small building demonstrating site analysis, human‑centred design, and integration of analogue and digital techniques." }
    ],
    "synopsis": "You'll be challenged to design a small building that engages meaningfully with its environment, users, and community. Integrating analogue and digital techniques to develop human-centric architectural proposals.",
    "outcomes": [
      "MO1 Develop proposals responding to site‑specific, environmental and user needs, demonstrating human‑centred design.",
      "MO2 Integrate analogue and digital techniques across the design process and representation.",
      "MO3 Explore and apply experiential qualities—light, movement and thresholds—to enhance architectural experience.",
      "MO4 Demonstrate teamwork principles and interdisciplinary perspectives in collaboratively refining ideas."
    ],
    "arb": []
  },
  "UBLL5S-15-1": {
    "id": "UBLL5S-15-1",
    "year of study": "1",
    "moduleName": "Professional Principles and Digital Practice",
    "moduleTheme": "Professional Practice and Behaviours",
    "keyInfo": [
      { "label": "Credits", "value": "15" },
      { "label": "Assessment", "value": "Project (Pass/Fail): PDF portfolio of 2D/3D outputs plus a short reflection on professional ethics and the architect’s role." }
    ],
    "synopsis": "You'll learn the foundational principles of architectural practice and digital representation. Exploring professional responsibilities, ethics, and software for effective architectural communication.",
    "outcomes": [
      "MO1 Demonstrate proficiency in 2D CAD, basic 3D modelling and rendering to professional drawing conventions.",
      "MO2 Reflect on the architect’s role, responsibilities and workflows in practice and society.",
      "MO3 Communicate architectural ideas clearly using digital media, meeting professional standards."
    ],
    "arb": []
  },
  "UBLL6T-30-1": {
    "id": "UBLL6T-30-1",
    "year of study": "1",
    "moduleName": "Making Sustainable Architecture",
    "moduleTheme": "Technology and Environment",
    "keyInfo": [
      { "label": "Credits", "value": "30" },
      { "label": "Duration", "value": "Full Year" },
      { "label": "Assessment", "value": "Two reports (50% + 50%): (1) Technical report on thermal performance and material/assembly strategy; (2) Environmental design report documenting a small sustainable building proposal with details." }
    ],
    "synopsis": "You'll explore how builds interact with their environmental contexts. Getting to grips with sustainable architectural design principles, exploring structural technologies, passive strategies, material selection, and energy performance for environmental responsibility.",
    "outcomes": [
      "MO1 Analyse and apply principles of thermal performance, appropriate structural systems and ethical considerations.",
      "MO2 Develop sustainable construction details addressing insulation, air‑tightness and material impacts.",
      "MO3 Design and represent a small‑scale sustainable building integrating environmental principles, material science and construction sequencing.",
      "MO4 Communicate sustainable concepts through clear visual, verbal and technical outputs with reference to ethical/environmental considerations."
    ],
    "arb": []
  },
  "UBLL58-15-1": {
    "id": "UBLL58-15-1",
    "year of study": "1",
    "moduleName": "Contexts of Architecture 1 - Cities and Society",
    "moduleTheme": "Humanities",
    "keyInfo": [
      { "label": "Credits", "value": "15" },
      { "label": "Assessment", "value": "Exhibition (Pass/Fail): Curated display integrating sketches, diagrams, photographs and short texts connecting history/culture to contemporary practice." }
    ],
    "synopsis": "You'll dive into the foundational principles of architectural history and cultural contexts that shape our built environment. Exploring the interplay between architecture, events, society, and diverse cultural perspectives.",
    "outcomes": [
      "MO1 Record and represent architectural spaces/movements via sketches, diagrams and photographs, reflecting on historical/cultural significance.",
      "MO2 Explore relationships between architecture, politics and cultural movements with attention to diverse and underrepresented perspectives.",
      "MO3 Analyse precedents and communicate their relevance to contemporary design through creative and critical outputs."
    ],
    "arb": []
  },
  "UBLL74-30-2": {
    "id": "UBLL74-30-2",
    "year of study": "2",
    "moduleName": "Studio 2.1 - Living",
    "moduleTheme": "Studio",
    "keyInfo": [
      { "label": "Credits", "value": "30" },
      { "label": "Semester", "value": "1" },
      { "label": "Assessment", "value": "Portfolio (100%): Design portfolio with drawings, models and written reflections; verbal presentation." }
    ],
    "synopsis": "You'll explore housing design principles  and practices, addressing socio-political, environmental, and cultural contexts through typological variety, spatial adaptability, and user-centred approaches.",
    "outcomes": [
      "MO1 Develop housing designs for a specific user group that address urban, cultural and environmental contexts while satisfying user needs.",
      "MO2 Integrate sustainable construction and environmental principles into housing design.",
      "MO3 Communicate architectural concepts effectively through drawings, models and written reflections, applying professional conventions.",
      "MO4 Evaluate planning and socio-political structures that inform housing design in different contexts."
    ],
    "arb": []
  },
  "UBLL75-30-2": {
    "id": "UBLL75-30-2",
    "year of study": "2",
    "moduleName": "Architecture Studio 2.2",
    "moduleTheme": "Studio",
    "keyInfo": [
      { "label": "Credits", "value": "30" },
      { "label": "Semester", "value": "2" },
      { "label": "Assessment", "value": "Portfolio (100%): Urban/public design portfolio evidencing analysis, iterative development and final proposal; verbal presentation." }
    ],
    "synopsis": "You'll bridge academic study with professional practice through live projects addressing community needs, environmental concerns, and social responsibility in architecture.",
    "outcomes": [
      "MO1 Identify, analyse and model relevant parameters for architectural design in context, addressing social, cultural and environmental challenges through iteration.",
      "MO2 Develop a well‑organised building proposal integrating context, user needs and environmental performance.",
      "MO3 Communicate architectural and urban design ideas effectively through drawings, models and verbal presentations.",
      "MO4 Explore and reflect on social and cultural contexts, integrating interdisciplinary approaches to address societal and environmental challenges."
    ],
    "arb": []
  },
  "UBLL7B-30-2": {
    "id": "UBLL7B-30-2",
    "year of study": "2",
    "moduleName": "Environmental Design Strategies and Innovations",
    "moduleTheme": "Technology and Environment",
    "keyInfo": [
      { "label": "Credits", "value": "30" },
      { "label": "Assessment", "value": "Two reports (50% + 50%): (1) Technical report using simulation to evaluate performance and detailing; (2) Design report synthesising environmental strategies and construction detailing into a proposal." }
    ],
    "synopsis": "You'll advance your understanding of environmental design, sustainable construction systems, and innovative building techniques. Exploring how we can address today's and tomorrow's pressing global challenges.",
    "outcomes": [
      "MO1 Analyse and optimise building performance using simulation tools and digital workflows, focusing on environmental comfort and energy efficiency.",
      "MO2 Integrate sustainable construction systems and innovative materials into architectural designs.",
      "MO3 Develop detailed design proposals balancing environmental performance, structural integration and architectural expression.",
      "MO4 Apply statutory frameworks and industry standards—including fire/life safety, energy and environmental regulations—to ensure compliance and ethical practice."
    ],
    "arb": []
  },
  "UBLL7C-15-2": {
    "id": "UBLL7C-15-2",
    "year of study": "2",
    "moduleName": "Collaboration and Coordination",
    "moduleTheme": "Professional Practice and Behaviours",
    "keyInfo": [
      { "label": "Credits", "value": "15" },
      { "label": "Assessment", "value": "Project (100%): Digital Report (60%) developing a BIM model with metadata and extracted schedules/drawings; Team BIM Execution Plan (40%)." }
    ],
    "synopsis": "You'll learn to use Building Information Modelling (BIM) for collaborative design and project coordination. Developing your technical skills and their real-world application, as well as your teamworking abilities.",
    "outcomes": [
      "MO1 Collaborate within teams to develop and present an effective BIM Execution Plan for an architectural project.",
      "MO2 Apply BIM and digital workflows to create coordinated and collaborative design outputs.",
      "MO3 Reflect critically on ethical responsibilities, professional standards and statutory requirements in collaborative practice."
    ],
    "arb": []
  },
  "UBLL7D-15-2": {
    "id": "UBLL7D-15-2",
    "year of study": "2",
    "moduleName": "Contexts of Architecture 2 - Histories and Theories",
    "moduleTheme": "Humanities",
    "keyInfo": [
      { "label": "Credits", "value": "15" },
      { "label": "Assessment", "value": "Portfolio (100%): Lecture Notebook, Historical Study (e.g., model/film/photographic or 1500‑word essay) and a 500‑word Written Commentary." }
    ],
    "synopsis": "You'll advance your understanding of environmental design, sustainable construction systems, and innovative building techniques. Exploring how we can address today's and tomorrow's pressing global challenges.",
    "outcomes": [
      "MO1 Explore and critically analyse global historical contexts and architectural traditions to develop curiosity‑driven insights that inspire innovative thinking.",
      "MO2 Investigate and compare architectural typologies and cultural precedents using interdisciplinary approaches to inform theory and practice.",
      "MO3 Communicate historical and theoretical insights effectively using visual and written media."
    ],
    "arb": []
  },
  "UBLL7Y-60-3": {
    "id": "UBLL7Y-60-3",
    "year of study": "3",
    "moduleName": "Architecture Studio 3",
    "moduleTheme": "Studio",
    "keyInfo": [
      { "label": "Credits", "value": "60" },
      { "label": "Duration", "value": "Full Year" },
      { "label": "Assessment", "value": "Design Research Exhibition (30%) + Design Portfolio (70%)." }
    ],
    "synopsis": "You'll carry out research-driven and experimental design development, critically and creatively addressing complex and multi-faceted architectural briefs. Developing the critical thinking skills needed for professional practice.",
    "outcomes": [
      "MO1 Conduct contextual research and analysis, including environmental and sustainability considerations, to inform key design ideas using appropriate media.",
      "MO2 Develop and resolve a complex design proposal that responds to complex briefs, integrating innovative and sustainable approaches to articulate a clear architectural intention.",
      "MO3 Apply statutory frameworks and material performance criteria to develop spatial strategies that enhance relationships between space, form, and user experience in complex contexts.",
      "MO4 Communicate a well‑resolved design proposal effectively using professional standards of media and architectural conventions."
    ],
    "arb": []
  },
  "UBLL7W-30-3": {
    "id": "UBLL7W-30-3",
    "year of study": "3",
    "moduleName": "Connected Construction and Digital Design",
    "moduleTheme": "Technology and Environment",
    "keyInfo": [
      { "label": "Credits", "value": "30" },
      { "label": "Duration", "value": "Full Year" },
      { "label": "Assessment", "value": "Pre‑Recorded Presentation (50%) + Detailed Design Report with drawings and 1:20 section (50%)." }
    ],
    "synopsis": "You'll gain advanced knowledge and skills in construction technologies, digital workflows, and sustainability – so you can develop sophisticated and technically robust architectural projects.",
    "outcomes": [
      "MO1 Apply digital strategies to optimise building performance.",
      "MO2 Develop integrated technology and environmental strategies that balance architectural expression, user needs and performance requirements.",
      "MO3 Identify and apply statutory frameworks, safety requirements and material performance criteria addressing structural, environmental, regulatory and fire safety requirements.",
      "MO4 Evaluate innovative and sustainable construction technologies, integrating material, component and system choices into detailed architectural elements."
    ],
    "arb": []
  },
  "UBLL7K-15-3": {
    "id": "UBLL7K-15-3",
    "year of study": "3",
    "moduleName": "Employability, Ethics, and Enterprise",
    "moduleTheme": "Professional Practice and Behaviours",
    "keyInfo": [
      { "label": "Credits", "value": "15" },
      { "label": "Assessment", "value": "Project (100%): Personal & Practice Identity (e.g., pitch video, business plan, website, or live presentation) plus reflective components (CV + learning plan + 1,000‑word essay)." }
    ],
    "synopsis": "You'll prepare for architectural practice by exploring ethical principles, statutory requirements, and practice management strategies. Developing your professional identity and vital employability skills.",
    "outcomes": [
      "MO1 Demonstrate a critical understanding of professional and ethical responsibilities, including compliance with the Architects’ Code of Conduct and statutory frameworks.",
      "MO2 Reflect on personal and professional growth, identifying strategies for lifelong learning and readiness for industry roles.",
      "MO3 Develop and articulate a professional identity that integrates employability strategies, sustainability, inclusivity and health & safety principles."
    ],
    "arb": []
  },
  "UBLL7T-15-3": {
    "id": "UBLL7T-15-3",
    "year of study": "3",
    "moduleName": "Critical Contexts",
    "moduleTheme": "Humanities",
    "keyInfo": [
      { "label": "Credits", "value": "15" },
      { "label": "Assessment", "value": "Independent Research Project (100%) – equivalent to ~5,000 words; flexible formats (essay/illustrated report/visual or multimedia)." }
    ],
    "synopsis": "You'll carry out an independent research project into a subject that combines your individual interests with your professional ambitions. You'll connect theory with practice, exploring architectural, cultural and technological challenges.",
    "outcomes": [
      "MO1 Formulate a clear, focused research question or thesis exploring architectural, cultural or technological challenges.",
      "MO2 Apply advanced research methodologies to analyse and interpret issues critically and creatively.",
      "MO3 Communicate research findings effectively using appropriate media and correct referencing."
    ],
    "arb": []
  }
}
