{
  "synopsis": "On the BSc (Hons) Architecture at UWE Bristol you will learn how to design buildings and spaces that are creative, sustainable, and socially responsible. The course is centred on design studio projects where you will develop ideas through drawings, models, digital tools, and live briefs. Studios are lively, collaborative spaces where you will work closely with tutors, your peers, and external partners to tackle real architectural challenges.\n\nAlongside design studio you will build your technical knowledge of construction, materials, structures and environmental design. You will explore how architecture responds to climate change, social equity, and cultural context, and learn how to integrate technical and environmental systems into your projects. Workshops, site visits, and live projects will give you opportunities to test ideas in practice and engage with communities and industry professionals.\n\nThe BSc is fully aligned with the professional frameworks set by the Royal Institute of British Architects (RIBA) and the Architects Registration Board (ARB). This means that by the end of the course you will have achieved RIBA Part 1, the first step towards becoming a registered architect. Many of our graduates progress directly to the MArch (Part 2), while others pursue careers in design, planning, sustainability, or the wider creative industries.\n\nYou will also benefit from UWE Bristol’s excellent facilities, including dedicated studio spaces, fabrication labs, workshops, and digital resources. You will be supported by academic personal tutors and a diverse community of staff and students. By the time you graduate you will have developed your own design identity and the skills, confidence and professional awareness to make a positive impact through architecture.",
  "outcomesIntro": "The Programme Learning Outcomes for the BSc (Hons) Architecture set out the knowledge, skills, and professional attributes you’ll develop across the three years. They align with current professional expectations and industry themes, ensuring you graduate with the capabilities required for progression and future architectural practice. These outcomes emphasise design, sustainability, technology, communication, ethics, cultural competence, and collaboration, preparing you to become a responsible, creative, and globally aware practitioner.",
  "learningAndTeaching": "Learning is centred on studio culture, where you will spend significant time working on projects, developing ideas, and presenting your work in reviews. This is supported by lectures, seminars, workshops, site visits, and community collaborations. Live projects and interdisciplinary teamwork give you experience of how architecture operates in practice.",
  "supportAndFacilities": "You will have access to purpose-built studios, digital resources, workshops, and fabrication labs. Support includes academic personal tutors, skills workshops, feedback tutorials, and wellbeing services. Field trips and study visits provide further opportunities to experience architecture in context.",
  "professionalRecognition": "The BSc (Hons) Architecture is prescribed by the Architects Registration Board (ARB) and validated by the Royal Institute of British Architects (RIBA) as a Part 1 qualification. This ensures the degree meets the professional standards required to progress towards becoming a registered architect.",
  "globalOpportunities": "You can apply for an International Academic Year after Year 2, studying abroad at a partner institution. This offers the chance to broaden your cultural and professional experience before completing your degree at UWE.",
  "assessmentApproach": "Assessment is through portfolios, design reviews, written assignments, and presentations. Portfolios document your design development and technical learning, while reviews simulate professional practice by asking you to present to peers, staff, and industry guests. Written work develops your ability to research, reflect, and communicate critically.",
  "careerProspects": "Graduates typically progress to the MArch (Part 2) as the next step towards becoming a qualified architect. Others pursue roles in architectural practice, urban design, planning, sustainable consultancy, digital design, or the wider creative industries. The skills you develop – creativity, technical knowledge, critical thinking, teamwork and communication – are highly valued across the built environment sector.",
  "outcomes": [
    {
      "code": "PO1",
      "keyword": "Design Propositions",
      "description": "Develop innovative, sustainable design propositions that address and integrate social, cultural, and environmental challenges across diverse contexts."
    },
    {
      "code": "PO2",
      "keyword": "Contextual Analysis",
      "description": "Analyse contemporary designs within their social, historical, and theoretical contexts, demonstrating the application of critical thinking."
    },
    {
      "code": "PO3",
      "keyword": "Interdisciplinary Practice",
      "description": "Examine the complexity of interdisciplinary practice by evaluating the arguments, assumptions, and behaviours that underpin productive collaboration."
    },
    {
      "code": "PO4",
      "keyword": "Ethical Practice",
      "description": "Explore ethical practices and assess the designer’s role in advancing justice, social equity, and sustainable approaches in the context of the climate emergency."
    },
    {
      "code": "PO5",
      "keyword": "Regulatory Frameworks",
      "description": "Analyse statutory frameworks and evolving industry standards for stages of development, planning, procurement, health and safety, and wellbeing, demonstrating application through reflective and simulated practice."
    },
    {
      "code": "PO6",
      "keyword": "Curiosity and Identity",
      "description": "Demonstrate a curiosity-driven approach to design by engaging with diverse cultural perspectives, backgrounds, and activities, fostering continuous learning and innovation to develop a unique design identity and address architectural challenges."
    },
    {
      "code": "PO7",
      "keyword": "Communication",
      "description": "Communicate complex architectural ideas and design concepts effectively through visual, verbal, and written methods, demonstrating clarity, creativity, and critical thinking."
    },
    {
      "code": "PO8",
      "keyword": "Digital and Analogue Techniques",
      "description": "Utilise digital and analogue techniques, including CAD, BIM, and emerging technologies, to articulate and present design concepts with clarity and impact."
    },
    {
      "code": "PO9",
      "keyword": "Sustainable Integration",
      "description": "Demonstrate a knowledge of sustainable and resilient architectural solutions by integrating structures, materials, and building systems with considerations for fire and life safety, environmental impact, and climate resilience."
    },
    {
      "code": "PO10",
      "keyword": "Spatial Design",
      "description": "Apply spatial design strategies to enhance the relationships between space, form, and human experience across social, cultural, and environmental contexts."
    }
  ]
}
