{
  "synopsis": "The BSc (Hons) Architecture at UWE Bristol is a dynamic undergraduate degree designed to equip students with the critical, creative, and technical skills necessary for contemporary architectural practice. With a distinctive focus on the relationship between design ambition and material reality, the programme explores principles of construction, materials, and the integration of innovative building technologies. Students develop sustainable and inclusive design approaches through studio-based learning, technical workshops, and live projects, while critically engaging with the social, political, cultural, and environmental contexts of architecture.",
  "outcomesIntro": "The Programme Learning Outcomes for the BSc (Hons) Architecture set out the knowledge, skills, and professional attributes you’ll develop across the three years. They align with current professional expectations and industry themes, ensuring you graduate with the capabilities required for progression and future architectural practice. These outcomes emphasise design, sustainability, technology, communication, ethics, cultural competence, and collaboration, preparing you to become a responsible, creative, and globally aware practitioner.",
  "outcomes": [
    {
      "code": "PO1",
      "keyword": "Design Propositions",
      "description": "Develop innovative, sustainable design propositions that address and integrate social, cultural, and environmental challenges across diverse contexts."
    },
    {
      "code": "PO2",
      "keyword": "Contextual Analysis",
      "description": "Analyse contemporary designs within their social, historical, and theoretical contexts, demonstrating the application of critical thinking."
    },
    {
      "code": "PO3",
      "keyword": "Interdisciplinary Practice",
      "description": "Examine the complexity of interdisciplinary practice by evaluating the arguments, assumptions, and behaviours that underpin productive collaboration."
    },
    {
      "code": "PO4",
      "keyword": "Ethical Practice",
      "description": "Explore ethical practices and assess the designer’s role in advancing justice, social equity, and sustainable approaches in the context of the climate emergency."
    },
    {
      "code": "PO5",
      "keyword": "Regulatory Frameworks",
      "description": "Analyse statutory frameworks and evolving industry standards for stages of development, planning, procurement, health and safety, and wellbeing, demonstrating application through reflective and simulated practice."
    },
    {
      "code": "PO6",
      "keyword": "Curiosity and Identity",
      "description": "Demonstrate a curiosity-driven approach to design by engaging with diverse cultural perspectives, backgrounds, and activities, fostering continuous learning and innovation to develop a unique design identity and address architectural challenges."
    },
    {
      "code": "PO7",
      "keyword": "Communication",
      "description": "Communicate complex architectural ideas and design concepts effectively through visual, verbal, and written methods, demonstrating clarity, creativity, and critical thinking."
    },
    {
      "code": "PO8",
      "keyword": "Digital and Analogue Techniques",
      "description": "Utilise digital and analogue techniques, including CAD, BIM, and emerging technologies, to articulate and present design concepts with clarity and impact."
    },
    {
      "code": "PO9",
      "keyword": "Sustainable Integration",
      "description": "Demonstrate a knowledge of sustainable and resilient architectural solutions by integrating structures, materials, and building systems with considerations for fire and life safety, environmental impact, and climate resilience."
    },
    {
      "code": "PO10",
      "keyword": "Spatial Design",
      "description": "Apply spatial design strategies to enhance the relationships between space, form, and human experience across social, cultural, and environmental contexts."
    }
  ]
}
